app/Controllers/UserController.php

        }

        $genderModel = new GenderModel();
        $data['genders'] = $genderModel->findAll();
---
SELECT *
FROM `genders`